#+TITLE: Cubs Season Ticket Log 2018
#+AUTHOR: Allen McPherson

* Data
(Use C-c . to insert date, <RET> to insert new row, then tab through fields)

** STH Ticket Prices
These are the price we paid (as part of our STH package) for each class of tickets.

#+TBLNAME: ticket-classes
| class    | games |  price |
|----------+-------+--------|
| diamond  |     4 | 101.92 |
| marquee  |    19 |  94.08 |
| platinum |    13 |  77.28 |
| gold     |    15 |  63.84 |
| silver   |    21 |  49.28 |
| bronze   |     9 |  28.00 |

** 2018 Schedule

#+TBLNAME: game-schedule
| game-date        | opponent     | class    |  price |
|------------------+--------------+----------+--------|
| <2018-04-09 Mon> | pirates      | diamond  | 101.92 |
| <2018-04-11 Wed> | pirates      | bronze   |  28.00 |
| <2018-04-12 Thu> | pirates      | bronze   |  28.00 |
| <2018-04-13 Fri> | braves       | silver   |  49.28 |
| <2018-04-14 Sat> | braves       | gold     |  63.84 |
| <2018-04-15 Sun> | braves       | silver   |  49.28 |
| <2018-04-16 Mon> | cardinals    | silver   |  49.28 |
| <2018-04-17 Tue> | cardinals    | silver   |  49.28 |
| <2018-04-18 Wed> | cardinals    | silver   |  49.28 |
| <2018-04-26 Thu> | brewers      | bronze   |  28.00 |
| <2018-04-27 Fri> | brewers      | silver   |  49.28 |
| <2018-04-28 Sat> | brewers      | gold     |  63.84 |
| <2018-04-29 Sun> | brewers      | silver   |  49.28 |
| <2018-04-30 Mon> | rockies      | bronze   |  28.00 |
| <2018-05-01 Tue> | rockies      | bronze   |  28.00 |
| <2018-05-02 Wed> | rockies      | bronze   |  28.00 |
| <2018-05-07 Mon> | marlins      | bronze   |  28.00 |
| <2018-05-08 Tue> | marlins      | bronze   |  28.00 |
| <2018-05-09 Wed> | marlins      | bronze   |  28.00 |
| <2018-05-11 Fri> | white sox    | marquee  |  94.08 |
| <2018-05-12 Sat> | white sox    | marquee  |  94.08 |
| <2018-05-13 Sun> | white sox    | marquee  |  94.08 |
| <2018-05-22 Tue> | indians      | gold     |  63.84 |
| <2018-05-23 Wed> | indians      | gold     |  63.84 |
| <2018-05-25 Fri> | giants       | gold     |  63.84 |
| <2018-05-26 Sat> | giants       | platinum |  77.28 |
| <2018-05-27 Sun> | giants       | gold     |  63.84 |
| <2018-06-05 Tue> | phillies     | silver   |  49.28 |
| <2018-06-06 Wed> | phillies     | silver   |  49.28 |
| <2018-06-07 Thu> | phillies     | silver   |  49.28 |
| <2018-06-08 Fri> | pirates      | platinum |  77.28 |
| <2018-06-09 Sat> | pirates      | marquee  |  94.08 |
| <2018-06-10 Sun> | pirates      | platinum |  77.28 |
| <2018-06-18 Mon> | dodgers      | gold     |  63.84 |
| <2018-06-19 Tue> | dodgers      | gold     |  63.84 |
| <2018-06-20 Wed> | dodgers      | platinum |  77.28 |
| <2018-06-29 Fri> | twins        | marquee  |  94.08 |
| <2018-06-30 Sat> | twins        | diamond  | 101.92 |
| <2018-07-01 Sun> | twins        | marquee  |  94.08 |
| <2018-07-03 Tue> | tigers       | marquee  |  94.08 |
| <2018-07-04 Wed> | tigers       | diamond  | 101.92 |
| <2018-07-06 Fri> | reds         | marquee  |  94.08 |
| <2018-07-07 Sat> | reds         | marquee  |  94.08 |
| <2018-07-08 Sun> | reds         | marquee  |  94.08 |
| <2018-07-19 Thu> | cardinals    | marquee  |  94.08 |
| <2018-07-20 Fri> | cardinals    | marquee  |  94.08 |
| <2018-07-21 Sat> | cardinals    | diamond  | 101.92 |
| <2018-07-22 Sun> | cardinals    | marquee  |  94.08 |
| <2018-07-23 Mon> | diamondbacks | platinum |  77.28 |
| <2018-07-24 Tue> | diamondbacks | platinum |  77.28 |
| <2018-07-25 Wed> | diamondbacks | platinum |  77.28 |
| <2018-07-26 Thu> | diamondbacks | platinum |  77.28 |
| <2018-08-02 Thu> | padres       | gold     |  63.84 |
| <2018-08-03 Fri> | padres       | platinum |  77.28 |
| <2018-08-04 Sat> | padres       | marquee  |  94.08 |
| <2018-08-05 Sun> | padres       | platinum |  77.28 |
| <2018-08-10 Fri> | nationals    | marquee  |  94.08 |
| <2018-08-11 Sat> | nationals    | marquee  |  94.08 |
| <2018-08-12 Sun> | nationals    | marquee  |  94.08 |
| <2018-08-14 Tue> | brewers      | gold     |  63.84 |
| <2018-08-15 Wed> | brewers      | gold     |  63.84 |
| <2018-08-23 Thu> | reds         | silver   |  49.28 |
| <2018-08-24 Fri> | reds         | gold     |  63.84 |
| <2018-08-25 Sat> | reds         | platinum |  77.28 |
| <2018-08-26 Sun> | reds         | gold     |  63.84 |
| <2018-08-27 Mon> | mets         | silver   |  49.28 |
| <2018-08-28 Tue> | mets         | silver   |  49.28 |
| <2018-08-29 Wed> | mets         | silver   |  49.28 |
| <2018-09-10 Mon> | brewers      | silver   |  49.28 |
| <2018-09-11 Tue> | brewers      | silver   |  49.28 |
| <2018-09-12 Wed> | brewers      | silver   |  49.28 |
| <2018-09-14 Fri> | reds         | gold     |  63.84 |
| <2018-09-15 Sat> | reds         | platinum |  77.28 |
| <2018-09-16 Sun> | reds         | gold     |  63.84 |
| <2018-09-24 Mon> | pirates      | silver   |  49.28 |
| <2018-09-25 Tue> | pirates      | silver   |  49.28 |
| <2018-09-26 Wed> | pirates      | silver   |  49.28 |
| <2018-09-27 Thu> | pirates      | silver   |  49.28 |
| <2018-09-28 Fri> | cardinals    | platinum |  77.28 |
| <2018-09-29 Sat> | cardinals    | marquee  |  94.08 |
| <2018-09-30 Sun> | cardinals    | marquee  |  94.08 |
#+TBLFM: $4='(org-lookup-first $3 '(remote(ticket-classes,@2$1..@>$1)) '(remote(ticket-classes,@2$3..@>$3)))

** StubHub Listing Data

#+TBLNAME: stub-listing
| list-date        | game-date        | N | stub-low | stub-sug | stub-high | initial |
|------------------+------------------+---+----------+----------+-----------+---------|
| <2018-03-25 Sun> | <2018-04-09 Mon> | 2 |   101.00 |   113.00 |    130.00 |  150.00 |
| <2018-03-25 Sun> | <2018-04-11 Wed> | 2 |    19.00 |    19.00 |     21.00 |   21.00 |
| <2018-03-25 Sun> | <2018-04-12 Thu> | 2 |    14.00 |    17.00 |     20.00 |   20.00 |
| <2018-03-25 Sun> | <2018-04-13 Fri> | 2 |    25.00 |    26.00 |     33.00 |   35.00 |
| <2018-03-25 Sun> | <2018-04-14 Sat> | 2 |    56.00 |    57.00 |     75.00 |   80.00 |
| <2018-03-25 Sun> | <2018-04-15 Sun> | 2 |    28.00 |    30.00 |     49.00 |   50.00 |
| <2018-03-25 Sun> | <2018-04-16 Mon> | 2 |    23.00 |    24.00 |     39.00 |   40.00 |
| <2018-03-25 Sun> | <2018-04-17 Tue> | 2 |    20.00 |    23.00 |     25.00 |   25.00 |
| <2018-03-25 Sun> | <2018-04-18 Wed> | 2 |    27.00 |    29.00 |     42.00 |   45.00 |
| <2018-03-25 Sun> | <2018-04-26 Thu> | 2 |    15.00 |    19.00 |     60.00 |   60.00 |
| <2018-03-25 Sun> | <2018-04-27 Fri> | 2 |    29.00 |    33.00 |     47.00 |   50.00 |
| <2018-03-25 Sun> | <2018-04-28 Sat> | 2 |    54.00 |    55.00 |     74.00 |   75.00 |
| <2018-03-25 Sun> | <2018-04-29 Sun> | 2 |    32.00 |    32.00 |     59.00 |   60.00 |
| <2018-03-25 Sun> | <2018-04-30 Mon> | 2 |    14.00 |    15.00 |     24.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-01 Tue> | 2 |    11.00 |    15.00 |     19.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-02 Wed> | 2 |    15.00 |    15.00 |     16.00 |   20.00 |
| <2018-04-13 Fri> | <2018-05-07 Mon> | 2 |    15.00 |    16.00 |     18.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-08 Tue> | 2 |    15.00 |    15.00 |     17.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-09 Wed> | 2 |    18.00 |    20.00 |     24.00 |   30.00 |
| <2018-04-13 Fri> | <2018-05-11 Fri> | 2 |    95.00 |    98.00 |    109.00 |  120.00 |
| <2018-04-13 Fri> | <2018-05-12 Sat> | 2 |   126.00 |   128.00 |    137.00 |  150.00 |
| <2018-04-13 Fri> | <2018-05-13 Sun> | 2 |   100.00 |   104.00 |    116.00 |  125.00 |
| <2018-04-13 Fri> | <2018-05-22 Tue> | 2 |    44.00 |    45.00 |     62.00 |   65.00 |
| <2018-04-13 Fri> | <2018-05-23 Wed> | 2 |    43.00 |    45.00 |     62.00 |   65.00 |
| <2018-04-13 Fri> | <2018-05-25 Fri> | 2 |    56.00 |    57.00 |     75.00 |   75.00 |
| <2018-04-13 Fri> | <2018-05-26 Sat> | 2 |    73.00 |    75.00 |     85.00 |   95.00 |
| <2018-04-13 Fri> | <2018-05-27 Sun> | 2 |    55.00 |    56.00 |     69.00 |   75.00 |
| <2018-05-03 Thu> | <2018-06-05 Tue> | 2 |    33.00 |    34.00 |     42.00 |   50.00 |
| <2018-05-03 Thu> | <2018-06-06 Wed> | 2 |    32.00 |    34.00 |     39.00 |   45.00 |
| <2018-05-03 Thu> | <2018-06-07 Thu> | 2 |    38.00 |    39.00 |     55.00 |   60.00 |
| <2018-05-03 Thu> | <2018-06-08 Fri> | 2 |    70.00 |    72.00 |     78.00 |   80.00 |
| <2018-05-03 Thu> | <2018-06-09 Sat> | 2 |    91.00 |    93.00 |    105.00 |  120.00 |
| <2018-05-03 Thu> | <2018-06-10 Sun> | 2 |    61.00 |    71.00 |     79.00 |   85.00 |
| <2018-05-03 Thu> | <2018-06-18 Mon> | 2 |    52.00 |    54.00 |     73.00 |   80.00 |
| <2018-05-03 Thu> | <2018-06-19 Tue> | 2 |    48.00 |    52.00 |     63.00 |   70.00 |
| <2018-05-03 Thu> | <2018-06-20 Wed> | 2 |    65.00 |    78.00 |     94.00 |  110.00 |
| <2018-05-03 Thu> | <2018-06-29 Fri> | 2 |    90.00 |    92.00 |     98.00 |  100.00 |
| <2018-05-03 Thu> | <2018-06-30 Sat> | 2 |   112.00 |   116.00 |    124.00 |  130.00 |
| <2018-06-17 Sun> | <2018-07-01 Sun> | 2 |    75.00 |    80.00 |     92.00 |   80.00 |
| <2018-06-17 Sun> | <2018-07-03 Tue> | 2 |    74.00 |    84.00 |    100.00 |   90.00 |
| <2018-06-17 Sun> | <2018-07-04 Wed> | 2 |    85.00 |    89.00 |    105.00 |   95.00 |
| <2018-06-17 Sun> | <2018-07-06 Fri> | 2 |    79.00 |    83.00 |     96.00 |   90.00 |
| <2018-06-17 Sun> | <2018-07-07 Sat> | 2 |    88.00 |    89.00 |     93.00 |   89.00 |
| <2018-06-17 Sun> | <2018-07-08 Sun> | 2 |    56.00 |    65.00 |    100.00 |   80.00 |
| <2018-06-17 Sun> | <2018-07-26 Thu> | 2 |    48.00 |    50.00 |     62.00 |   60.00 |
| <2018-07-18 Wed> | <2018-08-02 Thu> | 2 |    45.00 |    47.00 |     49.00 |   85.00 |
| <2018-07-18 Wed> | <2018-08-03 Fri> | 2 |    72.00 |    76.00 |     78.00 |   95.00 |
| <2018-07-18 Wed> | <2018-08-04 Sat> | 2 |    86.00 |    95.00 |    104.00 |  115.00 |
| <2018-07-18 Wed> | <2018-08-05 Sun> | 2 |    65.00 |    69.00 |     73.00 |   97.00 |
| <2018-07-18 Wed> | <2018-08-10 Fri> | 2 |    89.00 |    92.00 |    105.00 |  130.00 |
| <2018-07-18 Wed> | <2018-08-11 Sat> | 2 |   115.00 |   117.00 |    122.00 |  130.00 |
| <2018-07-18 Wed> | <2018-08-12 Sun> | 2 |    62.00 |    64.00 |     90.00 |  130.00 |
| <2018-07-18 Wed> | <2018-08-14 Tue> | 2 |    49.00 |    50.00 |     57.00 |   85.00 |
| <2018-07-18 Wed> | <2018-08-15 Wed> | 2 |    51.00 |    53.00 |     66.00 |   85.00 |



** StubHub Sale Data

#+TBLNAME: stub-sale
| sale-date        | game-date        | sale-price | payout | initial |   delta |
|------------------+------------------+------------+--------+---------+---------|
| <2018-03-26 Mon> | <2018-04-13 Fri> |      35.00 |  31.50 |   35.00 |   -3.50 |
| <2018-04-08 Sun> | <2018-04-09 Mon> |      30.00 |  27.00 |  150.00 | -123.00 |
| <2018-04-08 Sun> | <2018-04-11 Wed> |      10.00 |   9.00 |   21.00 |  -12.00 |
| <2018-04-09 Mon> | <2018-04-12 Thu> |       8.00 |   7.20 |   20.00 |  -12.80 |
| <2018-04-13 Fri> | <2018-04-14 Sat> |      20.00 |  18.00 |   80.00 |  -62.00 |
| <2018-04-13 Fri> | <2018-04-18 Wed> |       9.00 |   8.10 |   45.00 |  -36.90 |
| <2018-04-14 Sat> | <2018-04-14 Sat> |      20.00 |  18.00 |   80.00 |  -62.00 |
| <2018-04-14 Sat> | <2018-04-15 Sun> |       8.00 |   7.20 |   50.00 |  -42.80 |
| <2018-04-15 Sun> | <2018-05-23 Wed> |      50.00 |  45.00 |   65.00 |  -20.00 |
| <2018-04-16 Mon> | <2018-04-17 Tue> |      10.00 |   9.00 |   25.00 |  -16.00 |
| <2018-04-25 Wed> | <2018-04-28 Sat> |      25.00 |  22.50 |   75.00 |  -52.50 |
| <2018-04-25 Wed> | <2018-04-26 Thu> |      10.00 |   9.00 |   60.00 |  -51.00 |
| <2018-04-25 Wed> | <2018-04-29 Sun> |      30.00 |  27.00 |   60.00 |  -33.00 |
| <2018-04-26 Thu> | <2018-04-27 Fri> |      15.00 |  13.50 |   50.00 |  -36.50 |
| <2018-04-29 Sun> | <2018-05-01 Tue> |      15.00 |  13.50 |   25.00 |  -11.50 |
| <2018-05-01 Tue> | <2018-05-02 Wed> |      10.00 |   9.00 |   20.00 |  -11.00 |
| <2018-05-02 Wed> | <2018-05-07 Mon> |      15.00 |  13.50 |   25.00 |  -11.50 |
| <2018-05-04 Fri> | <2018-05-11 Fri> |      80.00 |  72.00 |  120.00 |  -48.00 |
| <2018-05-08 Tue> | <2018-05-08 Tue> |      15.00 |  13.50 |   25.00 |  -11.50 |
| <2018-05-10 Thu> | <2018-05-27 Sun> |      60.00 |  54.00 |   75.00 |  -21.00 |
| <2018-05-11 Fri> | <2018-05-12 Sat> |      75.00 |  67.50 |  150.00 |  -82.50 |
| <2018-05-19 Sat> | <2018-05-25 Fri> |      55.00 |  49.50 |   75.00 |  -25.50 |
| <2018-05-20 Sun> | <2018-05-22 Tue> |      35.00 |  31.50 |   65.00 |  -33.50 |
| <2018-05-24 Thu> | <2018-06-06 Wed> |      45.00 |  40.50 |   45.00 |   -4.50 |
| <2018-05-25 Fri> | <2018-05-26 Sat> |      65.00 |  58.50 |   95.00 |  -36.50 |
| <2018-05-29 Tue> | <2018-06-05 Tue> |      35.00 |  31.50 |   50.00 |  -18.50 |
| <2018-06-04 Mon> | <2018-06-10 Sun> |      55.00 |  49.50 |   85.00 |  -35.50 |
| <2018-06-07 Thu> | <2018-06-07 Thu> |      20.00 |  18.00 |   60.00 |  -42.00 |
| <2018-06-07 Thu> | <2018-06-09 Sat> |      70.00 |  63.00 |  120.00 |  -57.00 |
| <2018-06-08 Fri> | <2018-06-08 Fri> |      30.00 |  27.00 |   80.00 |  -53.00 |
| <2018-06-09 Sat> | <2018-06-30 Sat> |     130.00 | 117.00 |  130.00 |  -13.00 |
| <2018-06-10 Sun> | <2018-06-18 Mon> |      60.00 |  54.00 |   80.00 |  -26.00 |
| <2018-06-12 Tue> | <2018-06-19 Tue> |      50.00 |  45.00 |   70.00 |  -25.00 |
| <2018-06-14 Thu> | <2018-06-20 Wed> |      60.00 |  54.00 |  110.00 |  -56.00 |
#+TBLFM: $4=$3*.9;%0.2f::$5='(org-lookup-first $2 '(remote(stub-listing,@2$2..@>$2)) '(remote(stub-listing,@2$7..@>$7)))::$6=$4-$5;%0.2f


** Personal Sale Data
Tickets NOT sold on StubHub.

#+TBLNAME: stub-sale
| sale-date        | game-date        | sale-price | payout |
|------------------+------------------+------------+--------|
| <2018-05-11 Fri> | <2018-05-13 Sun> |     100.00 | 100.00 |
| <2018-07-03 Tue> | <2018-07-03 Tue> |      94.00 |  94.00 |
| <2018-09-16 Sun> | <2018-09-16 Sun> |      60.00 |  60.00 |
#+TBLFM: $4=$3;%0.2f


** Personal Use
These are games that we used ourselves (didn't try and sell).

#+TBLNAME: non-stub
| game-date        | used | guests    |  price | note                     |
|------------------+------+-----------+--------+--------------------------|
| <2018-04-16 Mon> | both | bruce, al |  49.28 | actual game on 7/21/2018 |
| <2018-07-19 Thu> | both | bruce, al |  94.08 |                          |
| <2018-07-20 Fri> | both | bruce, al |  94.08 |                          |
| <2018-07-21 Sat> | both | bruce, al | 101.92 |                          |
| <2018-07-22 Sun> | both | bruce, al |  94.08 | doubleheader             |
| <2018-07-23 Mon> | both | bruce, al |  77.28 | doubleheader             |
| <2018-07-24 Tue> | both | bruce, al |  77.28 |                          |
| <2018-07-25 Wed> | both | bruce, al |  77.28 |                          |
| <2018-07-26 Thu> | both | bruce, al |  77.28 |                          |
| <2018-08-23 Thu> | both | bruce, al |  49.28 |                          |
| <2018-08-24 Fri> | both | bruce, al |  63.84 |                          |
| <2018-08-25 Sat> | both | bruce, al |  77.28 |                          |
| <2018-08-26 Sun> | both | bruce, al |  63.84 |                          |
| <2018-08-27 Mon> | both | bruce, al |  49.28 |                          |
| <2018-08-28 Tue> | both | bruce, al |  49.28 |                          |
| <2018-08-29 Wed> | both | bruce, al |  49.28 |                          |
| <2018-09-14 Fri> | al   | al, gary  |  63.84 | buy extra ticket for jk  |
#+TBLFM: $4='(org-lookup-first $1 '(remote(game-schedule,@2$1..@>$1)) '(remote(game-schedule,@2$4..@>$4)))


#+TBLNAME: cost-recovery
| game-date        |  price | sale-price | delta  | running-delta |
|------------------+--------+------------+--------+---------------|
| <2018-04-09 Mon> | 101.92 | 30.00      | -71.92 | -71.92        |
| <2018-04-11 Wed> |  28.00 | 10.00      | -18.00 | -89.92        |
| <2018-04-12 Thu> |  28.00 | 8.00       | -20.00 | -109.92       |
| <2018-04-13 Fri> |  49.28 | 35.00      | -14.28 | -124.2        |
| <2018-04-14 Sat> |  63.84 | 20.00      | -43.84 | -168.04       |
| <2018-04-15 Sun> |  49.28 | 8.00       | -41.28 | -209.32       |
| <2018-04-16 Mon> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-04-17 Tue> |  49.28 | 10.00      | -39.28 | #ERROR        |
| <2018-04-18 Wed> |  49.28 | 9.00       | -40.28 | #ERROR        |
| <2018-04-26 Thu> |  28.00 | 10.00      | -18.00 | #ERROR        |
| <2018-04-27 Fri> |  49.28 | 15.00      | -34.28 | #ERROR        |
| <2018-04-28 Sat> |  63.84 | 25.00      | -38.84 | #ERROR        |
| <2018-04-29 Sun> |  49.28 | 30.00      | -19.28 | #ERROR        |
| <2018-04-30 Mon> |  28.00 | #ERROR     | #ERROR | #ERROR        |
| <2018-05-01 Tue> |  28.00 | 15.00      | -13.00 | #ERROR        |
| <2018-05-02 Wed> |  28.00 | 10.00      | -18.00 | #ERROR        |
| <2018-05-07 Mon> |  28.00 | 15.00      | -13.00 | #ERROR        |
| <2018-05-08 Tue> |  28.00 | 15.00      | -13.00 | #ERROR        |
| <2018-05-09 Wed> |  28.00 | #ERROR     | #ERROR | #ERROR        |
| <2018-05-11 Fri> |  94.08 | 80.00      | -14.08 | #ERROR        |
| <2018-05-12 Sat> |  94.08 | 75.00      | -19.08 | #ERROR        |
| <2018-05-13 Sun> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-05-22 Tue> |  63.84 | 35.00      | -28.84 | #ERROR        |
| <2018-05-23 Wed> |  63.84 | 50.00      | -13.84 | #ERROR        |
| <2018-05-25 Fri> |  63.84 | 55.00      | -8.84  | #ERROR        |
| <2018-05-26 Sat> |  77.28 | 65.00      | -12.28 | #ERROR        |
| <2018-05-27 Sun> |  63.84 | 60.00      | -3.84  | #ERROR        |
| <2018-06-05 Tue> |  49.28 | 35.00      | -14.28 | #ERROR        |
| <2018-06-06 Wed> |  49.28 | 45.00      | -4.28  | #ERROR        |
| <2018-06-07 Thu> |  49.28 | 20.00      | -29.28 | #ERROR        |
| <2018-06-08 Fri> |  77.28 | 30.00      | -47.28 | #ERROR        |
| <2018-06-09 Sat> |  94.08 | 70.00      | -24.08 | #ERROR        |
| <2018-06-10 Sun> |  77.28 | 55.00      | -22.28 | #ERROR        |
| <2018-06-18 Mon> |  63.84 | 60.00      | -3.84  | #ERROR        |
| <2018-06-19 Tue> |  63.84 | 50.00      | -13.84 | #ERROR        |
| <2018-06-20 Wed> |  77.28 | 60.00      | -17.28 | #ERROR        |
| <2018-06-29 Fri> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-06-30 Sat> | 101.92 | 130.00     | 28.08  | #ERROR        |
| <2018-07-01 Sun> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-03 Tue> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-04 Wed> | 101.92 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-06 Fri> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-07 Sat> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-08 Sun> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-19 Thu> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-20 Fri> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-21 Sat> | 101.92 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-22 Sun> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-23 Mon> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-24 Tue> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-25 Wed> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-07-26 Thu> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-02 Thu> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-03 Fri> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-04 Sat> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-05 Sun> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-10 Fri> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-11 Sat> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-12 Sun> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-14 Tue> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-15 Wed> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-23 Thu> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-24 Fri> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-25 Sat> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-26 Sun> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-27 Mon> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-28 Tue> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-08-29 Wed> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-10 Mon> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-11 Tue> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-12 Wed> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-14 Fri> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-15 Sat> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-16 Sun> |  63.84 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-24 Mon> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-25 Tue> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-26 Wed> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-27 Thu> |  49.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-28 Fri> |  77.28 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-29 Sat> |  94.08 | #ERROR     | #ERROR | #ERROR        |
| <2018-09-30 Sun> |  94.08 | #ERROR     | #ERROR | #ERROR        |
#+TBLFM: $2='(org-lookup-first $1 '(remote(game-schedule,@2$1..@>$1)) '(remote(game-schedule,@2$4..@>$4)))::$3='(org-lookup-first $1 '(remote(stub-sale,@2$2..@>$2)) '(remote(stub-sale,@2$3..@>$3)))::$4=$3-$2;%0.2f::$5=vsum(@I$4..$4)
